<?php

return [

    'grades' => 'الصفوف الدراسية',
    'grades_list' => 'قائمة الصفوف الدراسية',
    'add_grade'=> 'إضافة صف دراسي',
    'grade_name'=> 'اسم الصف الدراسي',
    'ar_grade_name'=> 'اسم الصف الدراسي بالعربية',
    'en_grade_name'=> 'اسم الصف الدراسي بالإنجليزية',
    'stage' => 'المرحة الدراسية',
    'select_grade'=> 'اختر مرحلة دراسية',
//    'ar_notes'=> 'ملاحظات بالعربية',
//    'en_notes'=> 'ملاحظات بالإنجليزية',
    'operations' => 'العمليات',
    'grade_edit' => 'تعديل الصف',
    'grade_delete' => 'حذف الصف',
    'no_grades' => 'لا يوجد صف دراسي',
    'delete_confirm' => 'هل أنت متأكد من حذف ',
    'delete_all_confirm' => 'هل أنت متأكد من حذف هذه الصفوف الدراسية ؟',
//    'submit' => 'حفظ البيانات',
    'cancel' => 'إلغاء',
    'save' => 'حفظ البيانات',
    'delete_all' => 'حذف المراحل المختارة',


    //validation
    'valid_required_ar_name' => 'يرجى إدخال اسم الصف الدراسي بالعربية.',
    'valid_required_en_name' => 'يرجى إدخال اسم الصف الدراسي بالإنجليزية.',
    'valid_regex_ar_name' => 'يلزم ادخال اسم الصف الدراسي بالعربية مكتوبا باللغة العربية.',
    'valid_regex_en_name' => 'يلزم ادخال اسم الصف الدراسي بالإنجليزية مكتوبا باللغة الإنجليزية.',
    'valid_unique_ar_name' => 'اسم الصف الدراسي بالعربية موجود من قبل.',
    'valid_unique_en_name' => 'اسم الصف الدراسي بالإنجليزية موجود من قبل.',
    'valid_required_stage' => 'يرجى ادخال المرحلة الدراسية.',
    'valid_integer_stage' => 'يرجى اختيار مرحلة دراسية مناسبة.',


    //flashes
    'add_success' => 'تم إضافة الصف الدراسي بنجاح.',
    'edit_success' => 'تم تعديل الصف الدراسي بنجاح.',
    'delete_success' => 'تم حذف الصفوف الدراسية بنجاح.',
];
