<?php

return [

    'stages' => 'المراحل الدراسية',
    'stages_list' => 'قائمة المراحل الدراسية',
    'add_stage'=> 'إضافة مرحلة دراسية',
    'stage_name'=> 'اسم المرحلة الدراسية',
    'ar_stage_name'=> 'اسم المرحلة الدراسية بالعربية',
    'en_stage_name'=> 'اسم المرحلة الدراسية بالإنجليزية',
    'notes'=> 'ملاحظات',
    'ar_notes'=> 'ملاحظات بالعربية',
    'en_notes'=> 'ملاحظات بالإنجليزية',
    'operations' => 'العمليات',
    'stage_edit' => 'تعديل المرحلة',
    'stage_delete' => 'حذف المرحلة',
    'no_stages' => 'لا يوجد مراحل دراسية',
    'delete_confirm' => 'هل أنت متأكد من حذف ',
    'submit' => 'إنشاء مرحلة',
    'cancel' => 'إلغاء',
    'save' => 'حفظ',


    //validation
    'valid_required_ar_name' => 'يرجى إدخال اسم المرحلة الدراسية بالعربية.',
    'valid_required_en_name' => 'يرجى إدخال اسم المرحلة الدراسية بالإنجليزية.',
    'valid_regex_ar_name' => 'يلزم ادخال اسم المرحلة الدراسية بالعربية مكتوبا باللغة العربية.',
    'valid_regex_en_name' => 'يلزم ادخال اسم المرحلة الدراسية بالإنجليزية مكتوبا باللغة الإنجليزية.',
    'valid_unique_ar_name' => 'اسم المرحلة الدراسية بالعربية موجود من قبل.',
    'valid_unique_en_name' => 'اسم المرحلة الدراسية بالإنجليزية موجود من قبل.',
    'valid_ar_notes' => 'ملاحظات بالعربية يجب ان يكون نص مكتوبا باللغة العربية.',
    'valid_en_notes' => 'ملاحظات بالعربية يجب ان يكون نص مكتوبا باللغة الإنجليزية.',


    //flashes
    'add_success' => 'تم إضافة المرحلة الدراسية بنجاح.',
    'edit_success' => 'تم تعديل المرحلة الدراسية بنجاح.',
    'delete_success' => 'تم حذف المرحلة الدراسية بنجاح.',
    'stage_has_children' => 'لا يمكن حذف المرحلة الدراسية بسبب وجود صفوف دراسية مرتبطة بها.',
];
