<?php

return [

    'subjects' => 'المواد الدراسية',
    'subjects_list' => 'قائمة المواد الدراسية',
    'add_subject'=> 'إضافة مادة',
    'edit_subject'=> 'تعديل المادة',
    'name'=> 'اسم المادة',
    'ar_name'=> 'اسم المادة باللغة العربية',
    'en_name'=> 'اسم المادة باللغة الإنجليزية',
    'operations' => 'العمليات',
    'edit' => 'تعديل',
    'delete' => 'حذف',
    'no_subjects' => 'لا يوجد مواد دراسية',
    'delete_confirm' => 'هل أنت متأكد من حذف ',
    'cancel' => 'إلغاء',
    'save' => 'حفظ',


    //validation
    'valid_name_ar_required' => 'يرجى إدخال اسم المادة باللغة العربية.',
    'valid_name_ar_unique' => 'اسم المادة باللغة العربية موجود من قبل.',
    'valid_name_ar_regex' => 'اسم المادة باللغة العربية يجب ان يكون مكتوبا بالعريية.',
    'valid_name_en_required' => 'يرجى إدخال اسم المادة باللغة الإنجليزية.',
    'valid_name_en_unique' => 'اسم المادة باللغة الإنجليزية موجود من قبل.',
    'valid_name_en_regex' => 'اسم المادة باللغة الإنجليزية يجب ان يكون مكتوبا بالإنجليزية.',


    //flashes
    'add_success' => 'تم إضافة المادة الدراسية بنجاح.',
    'edit_success' => 'تم تعديل المادة الدراسية بنجاح.',
    'delete_success' => 'تم حذف المادة الدراسية بنجاح.',
];
